U4038 

ITS A MISMATCH IN FD AND ITS PROBABLY TOO BIG OR SMALL FOR THE LRECL


IGZ0201W A file attribute mismatch was detected. File IFILE in program 
         specified in the ASSIGN clause had a record length of 80.     
IGZ0020S A logic error occurred.  Neither FILE STATUS nor a declarative
         HELLO at relative location X'28E'.  The status code was 48.   


CHANGE IN FILE DESCRIPTION LIKE THIS 

FILE SECTION.              
FD IFILE.                  
01 IFILE-RECS.             
   05 EMP-ID PIC 9(4).     
   05 FILLER PIC X(6).     
   05 EMP-NAME PIC X(11).  
   05 FILLER   PIC X(59).  

EQUALS 80 
