/* REXX */                                                        
/* A SHORT PROGRAM TO GREET YOU*/                                 
SAY "PLEASE TYPE YOUR NAME AND THEN PRESS ENTER"                  
PARSE PULL ANSWER                                                 
/* IF NOTHING IS TYPED THAN IT IS GREETED WITH A FIXED GREET" */  
IF ANSWER = ' 'THEN SAY "HELLO STANGER"                           
ELSE SAY "HELLO" ANSWER "!"                                       
EXIT                                                              
