run this cobol pgm and it creates the jcl for you includes job card and pgm 

just adjust the occurs 12 times 

and

until ws-index >=12


000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBOL1.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT JCL-OUTPUT ASSIGN TO CUSTDDI
000700     ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD JCL-OUTPUT.
001100 01 JCL-RECORD PIC X(80).
001200 WORKING-STORAGE SECTION.
001300 01 WS-JCL-LINES.
0I1400   05  WS-JCL-LINE      OCCURS 12 TIMES.
           10  LINE-TEXT    PIC X(80) VALUE SPACES.
       01 WS-INDEX            PIC 9(4) USAGE BINARY.
001500 PROCEDURE DIVISION.
001600 0000-MAIN.
001610     OPEN OUTPUT JCL-OUTPUT
001700     PERFORM INITIALIZE-JCL
001800     PERFORM WRITE-JCL VARYING WS-INDEX FROM 1 BY 1
001900            UNTIL WS-INDEX >= 12
002000     CLOSE JCL-OUTPUT
002100     STOP RUN.
002200 INITIALIZE-JCL.
002300     MOVE '//JOBNAME  JOB (ACCT),'      TO WS-JCL-LINE(1)
           MOVE '//             MSGLEVEL=(1,1),'  TO WS-JCL-LINE(2)
           MOVE '//             MSGCLASS=H,'      TO WS-JCL-LINE(3)
           MOVE '//             CLASS=A,'         TO WS-JCL-LINE(4)
           MOVE '//             NOTIFY=&SYSUID'   TO WS-JCL-LINE(5)
002400     MOVE '//STEP01   EXEC PGM=IEFBR14' TO WS-JCL-LINE(6)
           MOVE '//DD1      DD DSN=&SYSUID..BLUE1,' TO WS-JCL-LINE(7)
           MOVE '//             DISP=(NEW,CATLG,DELETE),
      -    ''       TO WS-JCL-LINE(8)
           MOVE '//             SPACE=(TRK,(8,10),RLSE),
      -    ''       TO WS-JCL-LINE(9)
           MOVE '//             UNIT=SYSDA,' TO WS-JCL-LINE(10)
           MOVE '//  DCB=(DSORG=PS,LRECL=80,RECFM=FB,BLKSIZE=800)
      -    ''       TO WS-JCL-LINE(11).
002800 WRITE-JCL.
002900     MOVE WS-JCL-LINE (WS-INDEX) TO JCL-RECORD
003000     WRITE JCL-RECORD.

